In [5]:
import pandas as pd

In [6]:
df = pd.read_csv("estudiantes.csv")

In [7]:
df

    NOMBRE  EDAD GENERO       CARRERA SEMESTRE
0   Victor    28      M     Auditoria   Primer
1   Josefa    23      F   Informatica   Primer
2     Raul    26      M       Derecho   Quinto
3  Mariana    27      F   Informatica  Septimo
4  Rodrigo    22      M       Derecho  Tercero
5  Gustavo    25      M  Arquitectura  Septimo
6     Lucy    23      F   Informatica   Primer
7    Sofia    24      F      Economia   Noveno

In [8]:
df.iloc[1,3]

'Informatica'

In [10]:
df.iloc[2,:3]

NOMBRE    Raul
EDAD        26
GENERO       M
Name: 2, dtype: object

In [11]:
df.loc[1,"SEMESTRE"]

'Primer'

In [15]:
df.loc[1,"EDAD"]

23